Hai,
We are facing the same issue on hashicorp/aws v4.29.0 version. 
Here is the config if that helps to reproduce: 

`  + resource "aws_elasticache_replication_group" "secondary" {
       + apply_immediately                     = (known after apply)
       + arn                                               = (known after apply)
       + at_rest_encryption_enabled     = (known after apply)
       + auto_minor_version_upgrade    = true
      + automatic_failover_enabled         = false
       + cluster_enabled                           = (known after apply)
        + configuration_endpoint_address = (known after apply)
       + data_tiering_enabled                      = (known after apply)
        + description                                       = "secondary replication group"
        + engine                                            = "redis"
        + engine_version                             = (known after apply)
        + engine_version_actual                = (known after apply)
       + global_replication_group_id        = "ldgnf-test-global-cy-cyogesh"
        + id                                                    = (known after apply)
       + maintenance_window                    = (known after apply)
        + member_clusters                          = (known after apply)
        + multi_az_enabled                          = false
       + node_type                                       = (known after apply)
        + num_cache_clusters                     = 1
        + num_node_groups                         = (known after apply)
       + number_cache_clusters                 = (known after apply)
        + parameter_group_name                = (known after apply)
        + primary_endpoint_address           = (known after apply)
       + reader_endpoint_address             = (known after apply)
        + replicas_per_node_group              = (known after apply)
        + replication_group_description      = (known after apply)
        + replication_group_id                       = "example-secondary"
        + security_group_ids                       = (known after apply)
        + security_group_names                 = (known after apply)
        + snapshot_window                         = (known after apply)
        + subnet_group_name                    = (known after apply)
        + tags_all                                          = (known after apply)
        + transit_encryption_enabled     = (known after apply)
  
       + cluster_mode {
            + num_node_groups         = (known after apply)
           + replicas_per_node_group = (known after apply)
         }
     }` 
Regards 
Yogesh Chandrakanth